SLS/src/Catalogs/ИсключенияВБазах1С/ИсключенияВБазах1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсключенияВБазах1С</name>
  <attributes>
    <name>ИмяСобытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсключенияШаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшШаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРассылки</name>
    <type>
      <types>CatalogRef.ГруппыПолучателейРассылок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииИсключений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

SLS/src/Catalogs/ИсключенияВБазах1С/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.ПередЗаписьюСправочника(ЭтотОбъект, "Ответственный, ГруппаРассылки, Категория");

	Хэш =		ЖурналИсключений.ХэшПоТекстамИсключений(ИмяСобытия, ТекстИсключения);
	ХэшШаблон =	ЖурналИсключений.ХэшПоТекстамИсключений(ИмяСобытия, ТекстИсключенияШаблон);
	
	Если ЗначениеЗаполнено(ИмяСобытия) И ЗначениеЗаполнено(ТекстИсключения) Тогда
		НаименованиеСобытия = ИмяСобытия + ": " + ТекстИсключения;
	ИначеЕсли ЗначениеЗаполнено(ИмяСобытия) Тогда
		НаименованиеСобытия = ИмяСобытия;
	Иначе
		НаименованиеСобытия = ТекстИсключения;
	КонецЕсли;
	
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, Символы.ПС, " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, Символы.Таб, " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, "     ", " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, "    ", " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, "   ", " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, "  ", " ");
	НаименованиеСобытия = СтрЗаменить(НаименованиеСобытия, "  ", " ");
	
	Наименование = НаименованиеСобытия;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСсылки = ДополнительныеСвойства.ДанныеСсылки;
	Если
		(
			ДополнительныеСвойства.ЭтоНовый
			И(
				ЗначениеЗаполнено(Ответственный)
				ИЛИ ЗначениеЗаполнено(ГруппаРассылки)
				ИЛИ ЗначениеЗаполнено(Категория)
			)
		)
		ИЛИ Ответственный <> ДанныеСсылки.Ответственный
		ИЛИ ГруппаРассылки <> ДанныеСсылки.ГруппаРассылки
		ИЛИ Категория <> ДанныеСсылки.Категория
		Тогда
		
		ЖурналИсключений.ЗаписатьРеквизитыВИсторию(, Ссылка, Новый Структура("Ответственный,ГруппаРассылки,Категория", Ответственный,ГруппаРассылки,Категория));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
